Revit 2027 API
UIApplication.Application Property
 Returns the database level Application represented by this UI level Application.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Application Application { get; }
Public ReadOnly Property Application As Application
	Get
public:
property Application^ Application {
	Application^ get ();
}
member Application : Application with get
Property Value
Application
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace